#ifndef MAP_H
#define MAP_H

#include <vector>
#include <QString>
using namespace std;

class Map
{
public:
    // 整个地图，为10x10的网格地图
    int map[10][10] = {0};

    // 0->不可放置的格子
    // 1->敌方地面路线(可放置我方阻拦、近战单位)
    // 2->可放置我方远程单位
    // 3->敌方飞行路线
    // 4->敌方飞行路线、地面路线共同格子(用于路线重合的情况)

//    int map[10][10] = {
//            {0, 0, 0, 0, 0, 0, 2, 1, 1, 1},
//            {0, 0, 0, 0, 0, 0, 2, 1, 2, 2},
//            {0, 0, 0, 0, 0, 0, 2, 1, 2, 0},
//            {0, 0, 0, 2, 2, 2, 2, 1, 2, 0},
//            {0, 0, 0, 2, 1, 1, 1, 1, 2, 0},
//            {0, 0, 0, 2, 1, 2, 2, 2, 2, 0},
//            {0, 0, 0, 2, 1, 2, 0, 0, 0, 0},
//            {2, 2, 2, 2, 1, 2, 0, 0, 0, 0},
//            {1, 1, 1, 1, 1, 2, 0, 0, 0, 0},
//            {2, 2, 2, 2, 2, 2, 0, 0, 0, 0}
//        };


    vector<pair<int, int>> path;      // 敌方从起点到终点的坐标数组, 目前没用
    Map();
    Map(QString filename);
};

#endif // MAP_H
